'''
프로그래밍 언어가 컴퓨터와 인간 중 어디에 더 가까운가? ----------------------------------------------------

컴퓨터--- Machine code ----Assembly lang.----- C ----- C++/Java ----- Ruby/Python ----- 인간
Low-level 저수준 언어                                                     High-level 고수준 언어
추상화 적음                                                               추상화 많음

-------------------------------------------------------------------------------------------------------
좋은 코드란?
 1. 가독성 좋은 코드 (= 헙업자 프로그래머가 읽기 쉬운 코드)
    - (1) Comment(주석); 상황에 맞는 적절한 주석을 파악하기
    - (2) Naming(이름 잘 짓기); 변수, 함수 등의 이름을 기능에 맞게 적절한 정도의 구체성으로 간결히 짓기.
 >>>
 변수의 이름 표기법 
  ex) 'math score'
  (1) math_score : snake 표기법
  (2) MathScore : pascal 표기법(두 단어의 첫 글자를 대문자로)
  (3) mathScore : camel 표기법(뒤의 단어의 첫 글자를 대문자로)
 * 언어마다 스타일 가이드가 존재함. ~> 스타일 가이드를 잘 지키기!
 how to check Style Guide??
 > Google) 언어 style guide

 2. 구조화가 잘 된 코드
    - 파일 분리: 관련된 코드를 필요한 만큼 한 파일에 관리하는 것.
    - 디자인 패턴: 프로그래밍에서 고질적으로 발생하는 문제들을 해결하는 패턴.
'''