'''
객체지향 프로그래밍 (Object-Oriented)--------------------------------------------------------------------

> What is Object-Oriented Programmin?
    - Top-down 방식: 하나의 프로그램에 필요한 여러 가지 기능을 부분적으로 나누어 각자가 분담해서 만든 뒤에 합침.
        -> 전체를 합칠 때에 프로그램이 제대로 작동하는지 확인할 수 있다는 문제가 있음.
    - Bottom-up 방식: 함수-데이터(변수)를 묶어서 Object(객체)라 하고, 객체 단위로 업무를 쪼개는 방식
        -> 예) [사용자객체]: 로그인 기능-아이디 데이터 / 친구 추가 기능-비밀번호 데이터 등등...
        -> 프로그램을 객체 단위로 점검하고 수정할 수 있음.

> When can we use Object-Oriented Language?
    많은 데이터를 다루는 프로그램
    규모가 큰 프로젝트
    -> 이 경우에 객체 지향의 장점이 부각된다.
    * 극도로 빠른 실행 속도가 필요하거나, 저장장치/성능이 제한적인 스마트 기기 등에서는 객체지향이 불리.
'''
